In [1]:
import pandas as pd

In [2]:
index = [0,1,2]
columns = ['c1','c2','c3','c4']

data = [
    [1,1,1,1],
    [2,2,2,2],
    [3,3,3,3]
]
df1 = pd.DataFrame(data, index=index, columns=columns)

In [3]:
df1

   c1  c2  c3  c4
0   1   1   1   1
1   2   2   2   2
2   3   3   3   3

In [4]:
index = [0,1,2]
columns = ['c1','c2','c3','c4']

data = [
    [11,11,11,11],
    [22,22,22,22],
    [33,33,33,33]
]
df2 = pd.DataFrame(data, index=index, columns=columns)

In [5]:
df2

   c1  c2  c3  c4
0  11  11  11  11
1  22  22  22  22
2  33  33  33  33

In [6]:
pd.concat([df1,df2], axis=0)

   c1  c2  c3  c4
0   1   1   1   1
1   2   2   2   2
2   3   3   3   3
0  11  11  11  11
1  22  22  22  22
2  33  33  33  33